avnet-iotconnect/iotc-freertos-stm32-u5/Projects/b_u585i_iot02a_ntz/Src/startup_main.c
/*
 * FreeRTOS STM32 Reference Integration
 *
 * Copyright (C) 2021 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * https://www.FreeRTOS.org
 * https://github.com/FreeRTOS
 *
 */

#include "logging_levels.h"

#define LOG_LEVEL    LOG_DEBUG

#include "logging.h"

#include "sys_evt.h"
#include "FreeRTOS.h"
#include "task.h"
#include "stm32u5xx.h"
#include "kvstore.h"
#include "hw_defs.h"
#include <string.h>
#include "lfs.h"
#include "fs/lfs_port.h"
#include "stm32u5xx_ll_rng.h"
#include "test_execution_config.h"
#include "cli/cli.h"
#include "iotc_sntp_time.h"
#include "config/iotconnect_config.h"
#include "ota_pal.h"

/*	Number of polls and interval between polls to check if sntp time has synced */
#define SNTP_SYNC_POLL_MAX 10
#define SNTP_SYNC_POLL_INTERVAL_MS	1000

/* Definition for Qualification Test */
#if ( DEVICE_ADVISOR_TEST_ENABLED == 1 ) || ( MQTT_TEST_ENABLED == 1 ) || ( TRANSPORT_INTERFACE_TEST_ENABLED == 1 ) || \
    ( OTA_PAL_TEST_ENABLED == 1 ) || ( OTA_E2E_TEST_ENABLED == 1 ) || ( CORE_PKCS11_TEST_ENABLED == 1 )
#define DEMO_QUALIFICATION_TEST    ( 1 )

#else
#define DEMO_QUALIFICATION_TEST    ( 0 )
#endif /* ( DEVICE_ADVISOR_TEST_ENABLED == 1 ) || ( MQTT_TEST_ENABLED == 1 ) || ( TRANSPORT_INTERFACE_TEST_ENABLED == 1 ) || \
        * ( OTA_PAL_TEST_ENABLED == 1 ) || ( OTA_E2E_TEST_ENABLED == 1 ) || ( CORE_PKCS11_TEST_ENABLED == 1 ) */

static lfs_t * pxLfsCtx = NULL;

EventGroupHandle_t xSystemEvents = NULL;


extern void net_main( void * pvParameters );
extern void sntp_task( void * );
extern void iotconnect_app( void * );
extern void otaPal_EarlyInit( void );


lfs_t * pxGetDefaultFsCtx( void )
{
    while( pxLfsCtx == NULL )
    {
        LogDebug( "Waiting for FS Initialization." );
        /* Wait for FS to be initialized */
        vTaskDelay( 1000 );
        /*TODO block on an event group bit instead */
    }

    return pxLfsCtx;
}

lfs_t xLfsCtx = { 0 };
const struct lfs_config * pxCfg;

static int fs_init( void )
{

    struct lfs_info xDirInfo = { 0 };

    /* Block time of up to 1 s for filesystem to initialize */
    pxCfg = pxInitializeOSPIFlashFs( pdMS_TO_TICKS( 30 * 1000 ) );

    /* mount the filesystem */
    int err = lfs_mount( &xLfsCtx, pxCfg );

    /* format if we can't mount the filesystem
     * this should only happen on the first boot
     */
    if( err != LFS_ERR_OK )
    {
        LogError( "Failed to mount partition. Formatting..." );
        err = lfs_format( &xLfsCtx, pxCfg );

        if( err == 0 )
        {
            err = lfs_mount( &xLfsCtx, pxCfg );
        }

        if( err != LFS_ERR_OK )
        {
            LogError( "Failed to format littlefs device." );
        }
    }

    if( lfs_stat( &xLfsCtx, "/cfg", &xDirInfo ) == LFS_ERR_NOENT )
    {
        err = lfs_mkdir( &xLfsCtx, "/cfg" );

        if( err != LFS_ERR_OK )
        {
            LogError( "Failed to create /cfg directory." );
        }
    }

#ifdef IOTCONFIG_ENABLE_OTA
    if( lfs_stat( &xLfsCtx, "/ota", &xDirInfo ) == LFS_ERR_NOENT )
    {
        err = lfs_mkdir( &xLfsCtx, "/ota" );

        if( err != LFS_ERR_OK )
        {
            LogError( "Failed to create /ota directory." );
        }
    }
#endif

    if( err == 0 )
    {
        /* Export the FS context */
        pxLfsCtx = &xLfsCtx;
    }

    return err;
}

typedef void ( * VectorTable_t )( void );

#define NUM_USER_IRQ               ( FMAC_IRQn + 1 )      /* MCU specific */
#define VECTOR_TABLE_SIZE          ( NVIC_USER_IRQ_OFFSET + NUM_USER_IRQ )
#define VECTOR_TABLE_ALIGN_CM33    0x400U

static VectorTable_t pulVectorTableSRAM[ VECTOR_TABLE_SIZE ] __attribute__( ( aligned( VECTOR_TABLE_ALIGN_CM33 ) ) );

/* Relocate vector table to ram for runtime interrupt registration */
static void vRelocateVectorTable( void )
{
    /* Disable interrupts */
    __disable_irq();

    HAL_ICACHE_Disable();
    HAL_DCACHE_Disable( pxHndlDCache );

    /* Copy vector table to ram */
    ( void ) memcpy( pulVectorTableSRAM, ( uint32_t * ) SCB->VTOR, sizeof( uint32_t ) * VECTOR_TABLE_SIZE );

    SCB->VTOR = ( uint32_t ) pulVectorTableSRAM;

    __DSB();
    __ISB();

    HAL_DCACHE_Invalidate( pxHndlDCache );
    HAL_ICACHE_Invalidate();
    HAL_ICACHE_Enable();
    HAL_DCACHE_Enable( pxHndlDCache );

    __enable_irq();
}

void vInitTask( void * pvArgs )
{
    BaseType_t xResult;
    int xMountStatus;

    ( void ) pvArgs;

    xResult = xTaskCreate( Task_CLI, "cli", 2048, NULL, 10, NULL );
    configASSERT( xResult == pdTRUE );

    xMountStatus = fs_init();

    if( xMountStatus == LFS_ERR_OK )
    {
        /*
         * FIXME: Need to debug  the cause of internal flash status register error here.
         * Clearing the flash status register as a workaround.
         */
        FLASH_WaitForLastOperation( 1000 );

        LogInfo( "File System mounted." );

#ifdef IOTCONFIG_ENABLE_OTA
        otaPal_EarlyInit();

        /*
         * TODO: Check if this is the first boot of a new image or pending self test.
         */

        /*
         * Users can add code to check sanity of image.  If we get a hardware reset or watchdog reset
         * prior to otaPal_SetPlatformImageState being called then the OTA mechanism will discard the
         * current image and revert to the previous image.
         *
         * The sanity of the image can be checked here or elsewhere, perhaps once the device is
         * connected.  For demonstration purposes we set the image to accepted here.
         */

        if (1) {
        	otaPal_AcceptImage();
        } else {
        	otaPal_RejectImage();
        }
#endif

        ( void ) xEventGroupSetBits( xSystemEvents, EVT_MASK_FS_READY );

        KVStore_init();
    }
    else
    {
        LogError( "Failed to mount filesystem." );
    }


    ( void ) xEventGroupSetBits( xSystemEvents, EVT_MASK_FS_READY );

    xResult = xTaskCreate( &net_main, "MxNet", 1024, NULL, 23, NULL );
    configASSERT( xResult == pdTRUE );

    ( void ) xEventGroupWaitBits( xSystemEvents,
                                  EVT_MASK_NET_CONNECTED,
                                  0x00,
                                  pdTRUE,
                                  portMAX_DELAY );

    HAL_GPIO_WritePin( LED_GREEN_GPIO_Port, LED_GREEN_Pin, GPIO_PIN_RESET );
    HAL_GPIO_WritePin( LED_RED_GPIO_Port, LED_RED_Pin, GPIO_PIN_SET );

    xResult = xTaskCreate( &sntp_task, "sntp", 2048, NULL, 23, NULL );
    configASSERT( xResult == pdTRUE );

    for (int t=0; t < SNTP_SYNC_POLL_MAX; t++) {
    	if (is_sntp_time_synced()) {
    		break;
    	}

    	vTaskDelay(pdMS_TO_TICKS(SNTP_SYNC_POLL_INTERVAL_MS));
    }

    xResult = xTaskCreate( iotconnect_app, "iotconnect_app", 4096, NULL, 5, NULL );
    configASSERT( xResult == pdTRUE );

    while( 1 )
    {
        vTaskSuspend( NULL );
    }
}

static uint32_t ulCsrFlags = 0;

static void vDetermineResetSource()
{
    const char * pcResetSource = NULL;

    ulCsrFlags &= ( RCC_CSR_LPWRRSTF_Msk | RCC_CSR_WWDGRSTF_Msk |
                    RCC_CSR_IWDGRSTF_Msk | RCC_CSR_SFTRSTF_Msk |
                    RCC_CSR_BORRSTF_Msk | RCC_CSR_PINRSTF_Msk |
                    RCC_CSR_OBLRSTF_Msk );

    if( ulCsrFlags & RCC_CSR_LPWRRSTF_Msk )
    {
        pcResetSource = "LPWRRSTF";
    }
    else if( ulCsrFlags & RCC_CSR_WWDGRSTF_Msk )
    {
        pcResetSource = "WWDGRSTF: Windowing Watchdog";
    }
    else if( ulCsrFlags & RCC_CSR_IWDGRSTF_Msk )
    {
        pcResetSource = "IWDGRSTF: Independent Watchdog";
    }
    else if( ulCsrFlags & RCC_CSR_SFTRSTF_Msk )
    {
        pcResetSource = "SFTRSTF: Software";
    }
    else if( ulCsrFlags & RCC_CSR_BORRSTF_Msk )
    {
        pcResetSource = "BORRSTF: Brownout";
    }
    else if( ulCsrFlags & RCC_CSR_OBLRSTF_Msk )
    {
        pcResetSource = "OBLRSTF: Option Byte Load";
    }
    else if( ulCsrFlags & RCC_CSR_PINRSTF_Msk )
    {
        pcResetSource = "PINRSTF: NSRT Pin";
    }
    else
    {
        pcResetSource = "Unknown";
    }

    LogSys( "Reset Source: 0x%x : %s.", ulCsrFlags, pcResetSource );
}

uint32_t ulGetResetSource( void )
{
    return ulCsrFlags;
}

int main( void )
{
    ulCsrFlags = RCC->CSR;

    __HAL_RCC_CLEAR_RESET_FLAGS();

    hw_init();

    vRelocateVectorTable();

    vLoggingInit();

    vDetermineResetSource();

    LogInfo( "HW Init Complete." );

    xSystemEvents = xEventGroupCreate();

    xTaskCreate( vInitTask, "Init", 1024, NULL, 8, NULL );

    /* Start scheduler */
    vTaskStartScheduler();

    /* Initialize threads */

    LogError( "Kernel start returned." );

    /* This loop should be inaccessible.*/
    while( 1 )
    {
        __NOP();
    }
}

UBaseType_t uxRand( void )
{
    return LL_RNG_ReadRandData32( RNG_NS );
}

/*-----------------------------------------------------------*/

/* configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
 * implementation of vApplicationGetIdleTaskMemory() to provide the memory that is
 * used by the Idle task. */
void vApplicationGetIdleTaskMemory( StaticTask_t ** ppxIdleTaskTCBBuffer,
                                    StackType_t ** ppxIdleTaskStackBuffer,
                                    uint32_t * pulIdleTaskStackSize )
{
    /* If the buffers to be provided to the Idle task are declared inside this
     * function then they must be declared static - otherwise they will be allocated on
     * the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle task's
     * state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}
/*-----------------------------------------------------------*/

/* configUSE_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the
 * application must provide an implementation of vApplicationGetTimerTaskMemory()
 * to provide the memory that is used by the Timer service task. */
void vApplicationGetTimerTaskMemory( StaticTask_t ** ppxTimerTaskTCBBuffer,
                                     StackType_t ** ppxTimerTaskStackBuffer,
                                     uint32_t * pulTimerTaskStackSize )
{
    /* If the buffers to be provided to the Timer task are declared inside this
     * function then they must be declared static - otherwise they will be allocated on
     * the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[ configTIMER_TASK_STACK_DEPTH ];

    /* Pass out a pointer to the StaticTask_t structure in which the Timer
     * task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}


/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
    LogError( "Malloc failed" );

    while( 1 )
    {
        __NOP();
    }
}

/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t xTask,
                                    char * pcTaskName )

{
    volatile uint32_t ulSetToZeroToStepOut = 1UL;

    taskENTER_CRITICAL();

    LogSys( "Stack overflow in %s", pcTaskName );
    ( void ) xTask;

    while( ulSetToZeroToStepOut != 0 )
    {
        __NOP();
    }

    taskEXIT_CRITICAL();
}

/*-----------------------------------------------------------*/
#if configUSE_IDLE_HOOK == 1
void vApplicationIdleHook( void )
{
    vPetWatchdog();
}
#endif /* configUSE_IDLE_HOOK == 1 */

/*-----------------------------------------------------------*/

void vDoSystemReset( void )
{
    /*TODO: Disconnect MQTT */
    /*TODO: Disconnect from WiFi */

    vPetWatchdog();

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        vTaskSuspendAll();
    }

    LogSys( "System Reset in progress." );

    /* Drain log buffers */
    vDyingGasp();

    NVIC_SystemReset();
}

/*-----------------------------------------------------------*/
